<!-- dflook/terraform-github-actions {"workspace":"judo-techniques-bot","backend_type":"remote","plan_modifier":"0cb9898a9f899d159eaee9923740a60625ce2e8ca3e076593e0fbc4f3deba575","backend":"f55c599486ccae5e01f16c9c269f53fb7f0dd52b3d095dfdfb33cef297a854db","plan_job_ref":"Job Terraform Plan #7 at https://github.com/AbundantSalmon/judo-techniques-bot/actions/runs/6761729797","plan_hash":"43e5fbd9d8ceea34dabc3ad20c81e69c8100d45a54b8bad803fe50f9531066ea","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __./terraform__ in the __judo-techniques-bot__ workspace
Replacing resources: `aws_instance.judo-techniques-bot`
<details>
<summary>Plan: 13 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.test will be read during apply
 <= data "template_file" "test" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #!/bin/bash
            echo "ECS_CLUSTER=judo-techniques-bot-ecs-cluster" >> /etc/ecs/ecs.config
        EOT
    }

  # aws_autoscaling_group.example_autoscaling_group will be created
  + resource "aws_autoscaling_group" "example_autoscaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "us-east-2a",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "OldestInstance",
        ]
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "example-ecs-instance"
        }
    }

  # aws_ecs_capacity_provider.test will be created
  + resource "aws_ecs_capacity_provider" "test" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "test"
      + tags_all = (known after apply)

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_termination_protection = (known after apply)
        }
    }

  # aws_ecs_cluster.judo-techniques-bot-ecs-cluster will be created
  + resource "aws_ecs_cluster" "judo-techniques-bot-ecs-cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "judo-techniques-bot-ecs-cluster"
      + tags_all           = (known after apply)
    }

  # aws_ecs_cluster_capacity_providers.example will be created
  + resource "aws_ecs_cluster_capacity_providers" "example" {
      + capacity_providers = [
          + "test",
        ]
      + cluster_name       = "judo-techniques-bot-ecs-cluster"
      + id                 = (known after apply)
    }

  # aws_ecs_service.example_service will be created
  + resource "aws_ecs_service" "example_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "example-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false
    }

  # aws_ecs_task_definition.example_task will be created
  + resource "aws_ecs_task_definition" "example_task" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + image   = "596332158252.dkr.ecr.us-east-2.amazonaws.com/judo-techniques-bot:latest"
                  + name    = "example-container"
                  + secrets = [
                      + {
                          + name      = "DB_HOST"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_host"
                        },
                      + {
                          + name      = "DB_NAME"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_name"
                        },
                      + {
                          + name      = "DB_USER"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_user"
                        },
                      + {
                          + name      = "DB_PORT"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_port"
                        },
                      + {
                          + name      = "DB_PASS"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_pass"
                        },
                      + {
                          + name      = "USER_AGENT"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/user_agent"
                        },
                      + {
                          + name      = "CLIENT_ID"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_client_id"
                        },
                      + {
                          + name      = "CLIENT_SECRET"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_client_secret"
                        },
                      + {
                          + name      = "REDDIT_USERNAME"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_username"
                        },
                      + {
                          + name      = "REDDIT_PASSWORD"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_password"
                        },
                      + {
                          + name      = "SUBREDDITS"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/subreddits"
                        },
                      + {
                          + name      = "SENTRY_DSN"
                          + valueFrom = "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/sentry_dsn"
                        },
                    ]
                },
            ]
        )
      + execution_role_arn       = (known after apply)
      + family                   = "example-task"
      + id                       = (known after apply)
      + memory                   = "427"
      + network_mode             = "host"
      + requires_compatibilities = [
          + "EC2",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # aws_iam_instance_profile.ecs_instance_profile will be created
  + resource "aws_iam_instance_profile" "ecs_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ecs-instance-profile"
      + path        = "/"
      + role        = "ecs-ec2-judo-techniques-bot-execution_role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.judo-techniques-bot-instance_profile will be created
  + resource "aws_iam_instance_profile" "judo-techniques-bot-instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "instance_profile"
      + path        = "/"
      + role        = "ecs-ec2-judo-techniques-bot-execution_role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ecs-ec2-judo-techniques-bot-execution_role will be created
  + resource "aws_iam_role" "ecs-ec2-judo-techniques-bot-execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-ec2-judo-techniques-bot-execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.ec2-judo-techniques-bot will be created
  + resource "aws_iam_role_policy" "ec2-judo-techniques-bot" {
      + id     = (known after apply)
      + name   = "ec2-judo-techniques-bot"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_host",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_name",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_pass",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_port",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/db_user",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_client_id",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_client_secret",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_password",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/reddit_username",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/sentry_dsn",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/subreddits",
                          + "arn:aws:ssm:us-east-2:596332158252:parameter/judo-techniques-bot/user_agent",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "ecs-ec2-judo-techniques-bot-execution_role"
    }

  # aws_iam_role_policy_attachment.judo-techniques-bot_ecs_task_permissions will be created
  + resource "aws_iam_role_policy_attachment" "judo-techniques-bot_ecs_task_permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "ecs-ec2-judo-techniques-bot-execution_role"
    }

  # aws_launch_template.foo will be created
  + resource "aws_launch_template" "foo" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "*********************"
      + instance_type          = "t4g.small"
      + latest_version         = (known after apply)
      + name                   = "foo"
      + name_prefix            = (known after apply)
      + tags_all               = (known after apply)
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + monitoring {
          + enabled = true
        }
    }

  # aws_security_group.ecs_security_group will be created
  + resource "aws_security_group" "ecs_security_group" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "ecs-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #7](https://github.com/AbundantSalmon/judo-techniques-bot/actions/runs/6761729797)